nxp-appcodehub/dm-mc-pmsm-ncp-frdm-mcxa156/frdmmcxa156/pin_mux.c
void BOARD_Init_RX_NCP_pins(void)
{
    const port_pin_config_t port_input_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     kPORT_NormalDriveStrength,
                                                     /* Pin is configured as P1_7 */
                                                     kPORT_MuxAlt0,
                                                     /* Digital input enabled */
                                                     kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    PORT_SetPinConfig(PORT3, NCP_HOST_GPIO_PIN_RX      , &port_input_config);
    PORT_SetPinConfig(PORT3, NCP_HOST_GPIO_PIN_RX_READY, &port_input_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
